// Задача 6. Аналіз номера медичної картки
//
// Напишіть програму, яка зчитує номер медичної картки
// і виводить три характеристики на основі ділення з остачею.
//
// Правила:
//   остання цифра (номер % 10):
//     0 або 1 → відділення: загальна терапія
//     2 або 3 → відділення: хірургія
//     4 або 5 → відділення: кардіологія
//     6 або 7 → відділення: неврологія
//     8 або 9 → відділення: офтальмологія
//
//   номер % 2 == 0 → пільгова картка: так
//   номер % 2 != 0 → пільгова картка: ні
//
//   номер % 3 == 0 → черговий огляд: так
//   номер % 3 != 0 → черговий огляд: ні
//
// Вхідні дані:
//   номер картки — ціле число (5–6 цифр)
//
// Вихідні дані:
//   Відділення: X
//   Пільгова:   так/ні
//   Огляд:      так/ні
//
// Приклади:
//   Вхід     Вихід
//   10240    Відділення: загальна терапія
//            Пільгова:   так
//            Огляд:      так
//
//   Вхід     Вихід
//   20003    Відділення: хірургія
//            Пільгова:   ні
//            Огляд:      так
//
//   Вхід     Вихід
//   11117    Відділення: неврологія
//            Пільгова:   ні
//            Огляд:      ні

public static class Task6
{
    public static void Run()
    {
        int card = int.Parse(Console.ReadLine()!);

        int lastDigit = card % 10;
        string department = lastDigit switch
        {
            0 or 1 => "загальна терапія",
            2 or 3 => "хірургія",
            4 or 5 => "кардіологія",
            6 or 7 => "неврологія",
            _      => "офтальмологія"
        };

        string discount = card % 2 == 0 ? "так" : "ні";
        string checkup  = card % 3 == 0 ? "так" : "ні";

        Console.WriteLine($"Відділення: {department}");
        Console.WriteLine($"Пільгова:   {discount}");
        Console.WriteLine($"Огляд:      {checkup}");
    }
}
