// Задача 2. Вартість прийому зі знижкою
//
// Напишіть програму, яка розраховує підсумкову вартість
// медичних прийомів з урахуванням знижки.
//
// Формула:
//   сума = ціна × кількість × (1 - знижка / 100)
//
// Вхідні дані:
//   ціна одного прийому — дійсне число (грн)
//   кількість прийомів  — ціле число
//   знижка              — ціле число (%)
//
// Вихідні дані:
//   Сума: X.XX грн
//
// Приклади:
//   Вхід          Вихід
//   500            Сума: 1350.00 грн
//   3
//   10
//
//   Вхід          Вихід
//   200            Сума: 1000.00 грн
//   5
//   0
//
//   Вхід          Вихід
//   750            Сума: 1275.00 грн
//   2
//   15

public static class Task2
{
    public static void Run()
    {
        double price    = double.Parse(Console.ReadLine()!);
        int    visits   = int.Parse(Console.ReadLine()!);
        int    discount = int.Parse(Console.ReadLine()!);

        double total = price * visits * (1 - discount / 100.0);

        Console.WriteLine($"Сума: {total:F2} грн");
    }
}
