// Задача 6. Рваний масив (jagged array) — прийоми лікарів
//
// Кожен лікар має різну кількість прийомів на тижні.
// Зчитайте рваний масив і знайдіть статистику по кожному лікарю.
//
// Вхідні дані:
//   N          — кількість лікарів (int)
//   Для кожного лікаря:
//     K        — кількість прийомів (int)
//     K рядків — вартість кожного прийому (int, грн)
//
// Вихідні дані:
//   Лікар 1: K прийомів, сума=X грн, середня=Y.YY грн
//   ...
//   Найбільший дохід: Лікар K (X грн)
//
// Приклад:
//   Вхід:       Вихід:
//   3           Лікар 1: 4 прийоми, сума=1800 грн, середня=450.00 грн
//   4           Лікар 2: 2 прийоми, сума=1600 грн, середня=800.00 грн
//   500         Лікар 3: 3 прийоми, сума=1350 грн, середня=450.00 грн
//   300         Найбільший дохід: Лікар 1 (1800 грн)
//   800
//   200
//   2
//   1000
//   600
//   3
//   400
//   250
//   700
//
//   Вхід:       Вихід:
//   2           Лікар 1: 2 прийоми, сума=600 грн, середня=300.00 грн
//   2           Лікар 2: 3 прийоми, сума=1200 грн, середня=400.00 грн
//   200         Найбільший дохід: Лікар 2 (1200 грн)
//   400
//   3
//   300
//   500
//   400

public static class Task6
{
    public static void Run()
    {
        int n = int.Parse(Console.ReadLine()!);
        int[][] costs = new int[n][];

        for (int i = 0; i < n; i++)
        {
            int k = int.Parse(Console.ReadLine()!);
            costs[i] = new int[k];
            for (int j = 0; j < k; j++)
                costs[i][j] = int.Parse(Console.ReadLine()!);
        }

        int[] totals = new int[n];
        for (int i = 0; i < n; i++)
        {
            foreach (int c in costs[i])
                totals[i] += c;
            double avg = (double)totals[i] / costs[i].Length;
            Console.WriteLine($"Лікар {i + 1}: {costs[i].Length} прийоми, сума={totals[i]} грн, середня={avg:F2} грн");
        }

        int maxIdx = 0;
        for (int i = 1; i < n; i++)
            if (totals[i] > totals[maxIdx]) maxIdx = i;

        Console.WriteLine($"Найбільший дохід: Лікар {maxIdx + 1} ({totals[maxIdx]} грн)");
    }
}
